"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/In aktuellen Ordner extrahieren";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Auf Schreibtisch extrahieren";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Extrahieren nach ...";